{
  "_page_0_Picture_0.jpeg": [
    "This is Image #1 / Fig.1 / Figure 1: \n![](_page_0_Picture_1.jpeg) <markdown>\nImage Analysis: ##Image Analysis:\n\nThe image appears to be a cover page or title page of a journal or publication. \n\nThe dominant feature is a blue and white background with a cityscape visible in the upper portion. The cityscape is somewhat blurred and appears to be a generic representation rather than a specific location.\n\nIn the center of the image, there is a circular logo containing a stylized letter \"J\" with two distinct colors: orange and blue. The logo is set against a white background within the circle.\n\nBelow the logo, the text \"JURNAL BISNIS DAN KOMUNIKASI DIGITAL\" is displayed prominently in blue font. The text is divided into three lines: \"JURNAL\", \"BISNIS DAN KOMUNIKASI\", and \"DIGITAL\".\n\nAt the bottom of the image, there is a thin line that combines blue and orange colors, mirroring the colors used in the logo.\n\nThe overall design suggests a professional and modern publication focused on digital business and communication. \n\nThis information is visible in the image."
  ],
  "_page_5_Picture_6.jpeg": [
    "This is Image #2 / Fig.2 / Figure 2: \n**Gambar 1.** Kesimetrisan yang Menjadikannya Pembeda <markdown>\nImage Analysis: ##Image Analysis:\n\nThe image depicts a character from an animated or video game context, presented against a gradient purple background that transitions from dark to light. The character is centered and stands upright, facing forward.\n\nThe character has white hair and wears an elaborate outfit consisting of:\n- A long, white coat with black accents and gold trim\n- A black and white top with gold accents\n- Red pants\n- Black boots with gold trim\n\nThe character's attire is detailed with various design elements, including gold accents on the belt, cuffs, and collar. The character's hands are positioned at their sides, with objects held in each hand, though the exact nature of these objects is not clearly visible.\n\nOverlaid on the image are graphical annotations:\n- Two horizontal orange lines, one positioned across the character's chest area and the other across the waist or hip area\n- Three vertical blue lines, extending from the top to the bottom of the image, passing through the character's body\n\nThe image is framed by a white border around its edges. The presence of the annotations suggests that the image is being used for analytical or illustrative purposes, possibly to highlight specific aspects of the character's design or proportions."
  ],
  "_page_6_Picture_2.jpeg": [
    "This is Image #3 / Fig.3 / Figure 3: \n**Gambar 2.** Pengotakkan pada Tubuh Jing Yuan yang Menampakkan Batas-Batas Tubuh Karakter Sehingga Memudahkan Pemahaman <markdown>\nImage Analysis: ##Image Analysis:\n\nThe image is a digital illustration of an anime-style character. The character is centered in the image and appears to be a male with long, white hair. He is wearing a complex outfit that includes a white jacket with black and gold accents, red pants, and a black belt with a gold buckle.\n\nThree orange rectangles are superimposed over the character's image. The largest rectangle encompasses the character's entire body from head to toe. The two smaller rectangles are positioned on either side of the character's torso, highlighting his upper body and arms.\n\nThe background of the image features a purple gradient, transitioning from a lighter shade at the bottom to a darker shade towards the top. The overall atmosphere suggests a fantasy or sci-fi setting.\n\nNo axes, legends, or statistical information are visible in the image. The image appears to be an annotated illustration rather than a scientific graph or chart. The annotations (orange rectangles) seem to be highlighting specific aspects of the character's design or body proportions. \n\nThis image is likely used for analytical or educational purposes in the context of character design or visual arts."
  ],
  "0__page_7_Picture_2.jpeg": [
    "This is Image #4 / Fig.4 / Figure 4: \n![](0__page_7_Picture_3.jpeg) <markdown>\nImage Analysis: ##Image Analysis:\n\nThe image depicts a character from a video game or animated series. The character is a male with white hair styled in a ponytail, wearing an elaborate costume.\n\nThe character's attire consists of:\n- A predominantly red and black outfit with white accents\n- A long coat or cloak with white lining\n- Armor-like elements on the chest, arms, and legs\n- Black boots\n\nThe image features blue annotations highlighting various parts of the character's body and costume, including:\n- The head and face\n- The chest armor\n- The forearms and hands\n- The lower legs\n\nThe background of the image is a gradient purple color, transitioning from a lighter shade at the center to a darker shade towards the edges.\n\nThis information is visible in the image."
  ],
  "0__page_7_Picture_3.jpeg": [
    "This is Image #5 / Fig.5 / Figure 5: \n- **Gambar 3.** Warna-Warna yang Dipadukan dalam Desain Jing Yuan Memudahkan Cara Pandang MataMemahaminya Seperti yang Ditunjukkan Lingkaran Biru (melingkari warna) dan Garis Oranye (menunjukkan kemudahan mata memandangnya) <markdown>\nImage Analysis: ##Image Analysis:\n\nThe image depicts a character from an anime or video game, with annotations highlighting specific design elements. \n\nThe character is centered in the image, facing forward with their eyes closed. They have white hair styled in a ponytail and wear a predominantly black and white outfit with red accents. The attire includes a long coat with white panels, black boots, and red pants.\n\nSeveral blue ellipses are overlaid on the character's image, encircling various parts of their body and costume. These ellipses appear to be highlighting specific design elements or color combinations used in the character's design. \n\nOrange lines are also present, intersecting the blue ellipses and the character's body at various points. These lines seem to be indicating the visual flow or ease of viewing the character's design, as suggested by the reference context.\n\nThe background of the image features a gradient that transitions from purple at the top to a lighter shade towards the bottom, providing a contrasting backdrop for the character.\n\nNo other annotations, labels, or legends are visible in the image. The overall presentation suggests that the image is being used to analyze or illustrate the design principles applied to the character's appearance."
  ],
  "0__page_7_Picture_7.jpeg": [
    "This is Image #6 / Fig.6 / Figure 6: \n**Gambar 4.** Arah Jatuhnya Pakaian Yaitu ke Bawah <markdown>\nImage Analysis: ##Image Analysis:\n\nThe image depicts a character from an animated or video game context, standing upright against a purple gradient background. The character is a male figure with white hair styled in a manner that suggests it is being blown back or is messy. He is dressed in a complex outfit that includes a long white coat with black and gold trim, red pants, and black boots. The attire is adorned with various design elements, including what appears to be armor plating on the boots and forearms.\n\nThe character is holding an object in his left hand, which is partially obscured but appears to be a weapon or tool with a blue component visible. His right shoulder bears an additional item or decoration that is not clearly defined.\n\nTo the right of the character, there is a large orange arrow pointing downwards. The arrow is positioned near the character's right hand, which is holding the aforementioned object. The background of the image transitions from a deep purple at the top to a lighter shade towards the bottom, creating a gradient effect.\n\nNo other elements, such as labels, axes, or legends, are visible in the image. The overall presentation suggests that the image is intended to illustrate a concept or direction related to the character or the object he is holding, as indicated by the prominent arrow."
  ]
}