{
  "_page_0_Picture_1.jpeg": [
    "This is Image #1 / Fig.1 / Figure 1: \n# **Sentiment Analysis of Honkai: Star Rail Indonesian Language Reviews on Google Play Store Using Bidirectional Encoder Representations from Transformers Method** <markdown>\nImage Analysis: ##Image Analysis:\n\nThe image appears to be the cover page of a journal or publication titled \"International Journal of Engineering, Science and Information Technology\" (IJESTY). \n\nThe cover features a prominent visual element: a blue-tinted globe with a grid pattern emanating from it, suggesting a technological or digital theme. The globe is centered and appears to be floating above a grid that is projected onto a darker surface, creating a sense of depth.\n\nAt the top-left corner, the abbreviation \"IJESTY\" is displayed in pink text, followed by the full title of the journal in white text: \"International Journal of Engineering, Science and Information Technology.\" \n\nIn the top-right corner, there is some text that is partially visible, reading \"eISSN: 2714-2014.\" This suggests that the journal is identified by the electronic ISSN (International Standard Serial Number) 2714-2014.\n\nThere is additional text at the bottom of the image, but it is too small to be legible. Therefore, the specific details or content of this text cannot be determined.\n\nThe background of the cover is a dark blue color, which provides a contrasting backdrop for the other visual elements.\n\nOverall, the image presents a professional and modern design, likely intended to represent the journal's focus on engineering, science, and information technology."
  ],
  "_page_0_Figure_12.jpeg": [
    "This is Image #2 / Fig.2 / Figure 2: \n**Fig 1.** The main reasons for using the internet in Indonesia [5] <markdown>\nImage Analysis: ##Image Analysis:\n\nThe image presents a horizontal bar chart titled \"Main Reasons for Using the Internet\" with data specific to Indonesia in January 2023. The chart is structured to display the primary reasons why internet users aged 16 to 64 use the internet.\n\n1. **Chart Structure and Organization:**\n   - The chart is organized with reasons for using the internet listed on the y-axis and the corresponding percentages on the x-axis.\n   - The data is represented using blue horizontal bars against a black background.\n\n2. **Labeled Elements and Annotations:**\n   - The title \"Main Reasons for Using the Internet\" is prominently displayed at the top.\n   - A subtitle clarifies that the data pertains to \"Primary reasons why internet users aged 16 to 64 use the internet.\"\n   - The Indonesian flag is shown on the top right, indicating the country represented.\n   - The chart includes a date, \"Jan 2023,\" in the top left corner.\n   - Logos for \"we are social\" and \"Meltwater\" are visible at the bottom right.\n\n3. **Data and Trends:**\n   - The main reasons for using the internet are listed in descending order of popularity.\n   - The top reason is \"Finding Information\" at 83.2%, followed by \"Finding New Ideas or Inspiration\" at 73.7%, and \"Staying in Touch with Friends and Family\" at 73.0%.\n   - Other reasons include \"Filling Up Spare Time and General Browsing\" (65.3%), \"Keeping Up-to-Date with News and Events\" (63.9%), \"Watching Videos, TV Shows, or Movies\" (61.3%), \"Accessing and Listening to Music\" (59.2%), \"Researching Products and Brands\" (49.5%), \"Researching How to Do Things\" (48.8%), \"Meeting New People and Making New Connections\" (44.8%), \"Gaming\" (42.3%), \"Researching Places, Vacations, and Travel\" (42.3%), \"Researching Health Issues and Healthcare Products\" (42.1%), \"Sharing Your Opinion\" (41.2%), and \"Managing Finances and Savings\" (39.2%).\n\n4. **Statistical Information:**\n   - Exact percentages are provided for each reason, allowing for a clear understanding of the relative importance of each activity.\n\n5. **Limitations or Qualifications:**\n   - The data is specific to Indonesia and internet users aged 16 to 64, which may not be representative of other age groups or countries.\n   - The source of the data is attributed to \"Datareportal 2023,\" as indicated at the bottom of the image, though the specific details of the source are not visible in the provided image.\n\nThe chart effectively illustrates the diverse reasons Indonesians use the internet, with a clear emphasis on information seeking and social connectivity."
  ],
  "_page_3_Figure_6.jpeg": [
    "This is Image #3 / Fig.3 / Figure 3: \n#### **4.2. Model Training Result** <markdown>\nImage Analysis: ##Image Analysis:\n\nThe image presents a bar graph titled \"Review Proportion\" and labeled as \"Fig 2. Review proportion\" at the bottom. The graph displays the distribution of reviews across three categories: Positive Review, Negative Review, and Neutral Review.\n\nThe x-axis lists the three review categories, while the y-axis is labeled \"Amount of Data\" and ranges from 0 to 4000 in increments of 500. Each category is represented by a distinct colored bar: green for Positive Review, red for Negative Review, and blue for Neutral Review.\n\nThe graph shows that:\n- Positive Reviews constitute the largest proportion, with 4232 data points (71%).\n- Negative Reviews are the second most prevalent, with 1252 data points (21%).\n- Neutral Reviews are the least common, with 516 data points (9%).\n\nThe graph effectively illustrates the relative proportions of the three review categories, providing a clear visual representation of the data distribution."
  ],
  "_page_3_Figure_12.jpeg": [
    "This is Image #4 / Fig.4 / Figure 4: \nFigure 3 shows that this model has an increased accuracy value in training and validation. The increase in accuracy in the validation looks fluctuating, this is because there is still ambiguous data such as reviews that should have positive sentiments but in the dataset are recorded as reviews with negative sentiments. This is a weakness of the score-based labeling technique. <markdown>\nImage Analysis: ##Image Analysis:\n\nThe image presents a line graph illustrating the training history of a model, labeled as \"Fig 3. Training history.\" The graph displays the accuracy (acc) on the y-axis, ranging from 0.0 to 1.0, against the epoch on the x-axis, spanning from 0.0 to 4.0.\n\nTwo distinct lines are plotted on the graph:\n1. A green line representing the training accuracy (\"train acc\")\n2. An orange line representing the validation accuracy (\"validation acc\")\n\nBoth lines exhibit an upward trend, indicating an increase in accuracy over the epochs. The training accuracy starts at approximately 0.7 at epoch 0.0 and rises to around 0.85 at epoch 4.0. The validation accuracy begins at about 0.8 at epoch 0.0 and reaches approximately 0.82 at epoch 4.0.\n\nThe graph includes a legend in the top-left corner, which clearly labels the two lines according to their respective colors and accuracy metrics. The overall structure of the graph is straightforward, with clear axis labels and a simple color scheme.\n\nNotably, the validation accuracy appears to be relatively stable, with only a slight increase over the epochs, whereas the training accuracy shows a more pronounced upward trend. This information is directly observable from the graph.\n\nNo additional annotations or statistical information are visible beyond the plotted lines and axis labels. The graph effectively conveys the training and validation accuracy of the model over the specified epoch range."
  ],
  "_page_4_Figure_4.jpeg": [
    "This is Image #5 / Fig.5 / Figure 5: \n**Fig 4.** Confusion matrix of model test results <markdown>\nImage Analysis: ##Image Analysis:\n\nThe image presents a confusion matrix, a type of heatmap used to evaluate the performance of a classification model. The matrix is structured with \"True sentiment\" on the y-axis and \"Predicted sentiment\" on the x-axis, both categorized into three sentiment classes: positive, neutral, and negative.\n\nThe matrix is populated with numerical values representing the count of instances for each true-predicted sentiment combination. The values are as follows:\n- For true positive sentiment: 97 predicted as positive, 3 as neutral, and 24 as negative.\n- For true neutral sentiment: 23 predicted as positive, 4 as neutral, and 24 as negative.\n- For true negative sentiment: 33 predicted as positive, 4 as neutral, and 381 as negative.\n\nThe color intensity of each cell in the matrix corresponds to the count, with a color bar on the right side indicating the scale from 0 to 350. The color bar transitions from light to dark green as the count increases, with the darkest green representing the highest count (381) in the matrix.\n\nThe visualization effectively illustrates the model's accuracy and misclassification patterns across different sentiment categories. The diagonal elements (97, 4, 381) represent correct predictions, while off-diagonal elements indicate misclassifications. \n\nThis confusion matrix provides a clear and concise overview of the model's performance, highlighting areas of strength and potential improvement in sentiment classification."
  ]
}