{
  "_page_3_Figure_6.jpeg": [
    "This is Image #1 / Fig.1 / Figure 1: \n**Gambar 1. Alur penelitian** <markdown>\nImage Analysis: ##Image Analysis:\n\nThe image is a flowchart diagram illustrating a research methodology, specifically a text classification process. The diagram is titled \"Gambar 1. Alur penelitian\" which translates to \"Figure 1. Research Flow\".\n\nThe flowchart begins with a circular node labeled \"Start\" and proceeds through various stages, ultimately concluding at a circular node labeled \"End\". The diagram is divided into several sections, each representing a distinct step in the research process.\n\n1. **Data Collection and Labeling**: \n   - The process starts with \"Collecting Dataset\" and \"Manual Labelling\", indicating the gathering and manual annotation of data.\n\n2. **Pre-Processing**:\n   - The pre-processing stage involves several steps:\n     - Punctuation Removal\n     - Case Folding\n     - Word Normalization\n     - Meaningless Removal\n     - Stemming\n     - Stopwords Removal\n     - Tokenizing\n   - These steps are sequentially arranged, suggesting a systematic approach to cleaning and preparing the text data.\n\n3. **Data Split**:\n   - The pre-processed data is then split into \"Data Train\" and \"Data Test\" using \"Split Data Stratified K-Fold\" with K=5, indicating a cross-validation technique to evaluate the model's performance.\n\n4. **Feature Extraction**:\n   - Both \"Data Train\" and \"Data Test\" undergo \"TF-IDF\" (Term Frequency-Inverse Document Frequency), a feature extraction method used to convert text data into a matrix of TF-IDF features.\n\n5. **Modeling and Evaluation**:\n   - The \"Data Train\" TF-IDF output is fed into \"Complement Naive Bayes\", a classification algorithm.\n   - The model is evaluated using the \"Data Test\" TF-IDF output.\n   - A \"Confusion Matrix\" is generated to assess the model's performance.\n   - \"Grid Search Hyperparameter Tuning\" is performed, indicating an optimization step to improve the model's performance.\n\n6. **Iteration**:\n   - The flowchart shows a loop from \"Complement Naive Bayes\" back to itself, conditioned on a \"No\" path, suggesting an iterative process or refinement based on certain criteria.\n\nThe diagram is structured to illustrate a clear sequence of operations from data collection to model evaluation and optimization. All elements, including boxes, arrows, and annotations, are clearly labeled, facilitating a straightforward understanding of the research methodology depicted."
  ],
  "0__page_11_Figure_6.jpeg": [
    "This is Image #2 / Fig.2 / Figure 2: \n**Gambar 2. Visualisasi** *confusion matrix* <markdown>\nImage Analysis: ##Image Analysis:\n\nThe image presents a heatmap titled \"Average Evaluation Metrics for Each Aspect.\" The heatmap is a 4x4 matrix, with four rows and four columns, displaying various evaluation metrics for different aspects.\n\n**Rows and Columns:**\n- The rows represent different aspects: Gameplay, Visual, Performance, and Feature.\n- The columns represent evaluation metrics: accuracy, precision, recall, and f1_score.\n\n**Heatmap Values:**\n- Each cell in the heatmap contains a numerical value representing the average evaluation metric for the corresponding aspect and metric.\n- The values are as follows:\n  - Gameplay: accuracy = 0.7200, precision = 0.7170, recall = 0.7200, f1_score = 0.7177\n  - Visual: accuracy = 0.6940, precision = 0.6939, recall = 0.6940, f1_score = 0.6928\n  - Performance: accuracy = 0.7780, precision = 0.7449, recall = 0.7780, f1_score = 0.7525\n  - Feature: accuracy = 0.7910, precision = 0.7714, recall = 0.7910, f1_score = 0.7762\n\n**Color Scale:**\n- The heatmap uses a color scale ranging from dark blue ( lowest values) to dark red (highest values).\n- The color scale is continuous, with values ranging from approximately 0.70 to 0.78.\n\n**Key Observations:**\n- The heatmap shows that the \"Feature\" aspect has the highest average evaluation metrics across all four metrics, with accuracy and recall being the highest at 0.7910.\n- The \"Visual\" aspect has the lowest average evaluation metrics across all four metrics, with f1_score being the lowest at 0.6928.\n- The \"Performance\" aspect has the second-highest average evaluation metrics, with accuracy and recall being 0.7780.\n\n**Overall:**\nThe heatmap provides a visual representation of the average evaluation metrics for different aspects, allowing for a quick comparison of the performance across various metrics and aspects."
  ],
  "0__page_12_Picture_5.jpeg": [
    "This is Image #3 / Fig.3 / Figure 3: \n**Gambar 3.** *Wordcloud gameplay* <markdown>\nImage Analysis: ##Image Analysis:\n\nThe image presents a figure titled \"Word Cloud for Positive Sentiment - Gameplay\" and \"Word Cloud for Negative Sentiment - Gameplay,\" collectively referred to as Figure 3 or \"Wordcloud gameplay.\" The figure consists of two word clouds side by side, each representing a different sentiment related to gameplay.\n\n1. **Left Word Cloud (Positive Sentiment):**\n   - The word cloud is predominantly green, indicating positive sentiment.\n   - The most prominent words are \"game,\" \"bug,\" \"bagus,\" and \"gacha,\" suggesting that players have positive experiences or comments about the game, its bugs, and its gacha system.\n   - Other visible words include \"tolong\" (help), \"seru\" (fun), and \"bagus\" (good), reinforcing the positive sentiment.\n   - The size of the words corresponds to their frequency or importance in the dataset.\n\n2. **Right Word Cloud (Negative Sentiment):**\n   - The word cloud is predominantly red, indicating negative sentiment.\n   - The most prominent words are \"game,\" \"main,\" and \"update,\" suggesting that players have negative experiences or comments related to the game, playing it, and updates.\n   - Other visible words include \"lag,\" \"error,\" \"ulang\" (repeat), and \"susah\" (difficult), highlighting issues such as lag, errors, and difficulty.\n   - Like the positive sentiment cloud, the size of the words corresponds to their frequency or importance in the dataset.\n\n3. **Common Observations:**\n   - Both word clouds contain the word \"game,\" indicating that it is a central theme in both positive and negative sentiments.\n   - The use of Indonesian words throughout both clouds suggests that the data is derived from Indonesian players or users.\n   - The visual representation effectively highlights the contrasting sentiments, with green for positive and red for negative, making it easy to distinguish between the two.\n\n4. **Overall:**\n   - The figure effectively visualizes the sentiments of players regarding gameplay, highlighting key areas of satisfaction and dissatisfaction.\n   - The word clouds provide a clear and concise representation of the data, allowing for quick identification of trends and themes in player sentiment."
  ],
  "0__page_12_Figure_7.jpeg": [
    "This is Image #4 / Fig.4 / Figure 4: \n**Gambar 4.** *Wordcloud visual* <markdown>\nImage Analysis: ##Image Analysis:\n\nThe image presents two word clouds side by side, each representing a different sentiment category. The left word cloud is labeled \"Word Cloud for Positive Sentiment - Visual,\" while the right one is labeled \"Word Cloud for Negative Sentiment - Visual.\" \n\n1. **Word Cloud Structure and Organization:**\n   - Both word clouds are composed of numerous words in varying sizes and colors, arranged randomly within their respective rectangular spaces.\n   - The words are predominantly in Indonesian, with a few possibly being abbreviations or proper nouns (e.g., \"genshin,\" \"gacha,\" \"GW\").\n\n2. **Positive Sentiment Word Cloud (Left):**\n   - The dominant color scheme is green, with some words appearing in red or dark green.\n   - The most prominent words, based on size, include \"bagus\" and \"game.\"\n   - Other visible words of significant size are \"main,\" \"story,\" \"gameplay,\" and \"bagus banget\" (though the latter is partially cut off).\n   - The presence of positive sentiment words like \"bagus\" (meaning \"good\") and \"suka\" (meaning \"like\") indicates a generally favorable tone.\n\n3. **Negative Sentiment Word Cloud (Right):**\n   - The dominant color scheme is red, with some words in orange or dark red.\n   - The most prominent words, based on size, include \"game,\" \"tolong\" (meaning \"help\"), and \"update.\"\n   - Other visible words of significant size are \"bug,\" \"login,\" \"device,\" and \"gamnya\" (possibly a colloquial or abbreviated form related to \"game\").\n   - The presence of negative sentiment words like \"bug,\" \"moga\" (possibly \"mohon\" or a variant, meaning \"please\"), and \"error\" (though not directly visible but inferred from context) indicates a generally unfavorable tone.\n\n4. **Comparison and Trends:**\n   - Both word clouds contain the word \"game\" prominently, indicating its central relevance to both positive and negative sentiments.\n   - The positive sentiment cloud highlights aspects like \"story\" and \"gameplay,\" suggesting that users appreciate these elements.\n   - The negative sentiment cloud emphasizes issues such as \"bug,\" \"login,\" and \"update,\" pointing to technical or usability problems.\n\n5. **Annotations and Legends:**\n   - There are no explicit legends or annotations beyond the titles of the two word clouds.\n\n6. **Statistical Information or Metrics:**\n   - No explicit statistical information or metrics are visible in the image.\n\n7. **Limitations or Qualifications:**\n   - The image does not provide information on the source of the data, the methodology used to generate the word clouds, or the size of the dataset.\n\nIn summary, the image effectively visualizes the positive and negative sentiments associated with a particular game or gaming experience, highlighting key themes and issues through the use of word clouds."
  ],
  "0__page_12_Figure_9.jpeg": [
    "This is Image #5 / Fig.5 / Figure 5: \n**Gambar 5.** *Wordcloud performance* <markdown>\nImage Analysis: ##Image Analysis:\n\nThe image presents a visualization titled \"Word Cloud for Positive Sentiment - Performance\" on the left and \"Word Cloud for Negative Sentiment - Performance\" on the right. The visualization is divided into two sections, each representing a word cloud associated with different sentiments regarding performance.\n\n**Left Section: Word Cloud for Positive Sentiment - Performance**\n- The word cloud is predominantly green, indicating positive sentiment.\n- The most prominent words visible in this cloud are \"game,\" \"yg,\" and \"fitur.\"\n- Other notable words include \"story,\" \"bagus,\" \"keren,\" \"tolong,\" and \"overall.\"\n- The size of the words corresponds to their frequency or importance in the context of positive sentiment towards performance.\n\n**Right Section: Word Cloud for Negative Sentiment - Performance**\n- The word cloud is predominantly red and orange, indicating negative sentiment.\n- The most prominent words visible in this cloud are \"game,\" \"main,\" \"bug,\" and \"update.\"\n- Other notable words include \"tolong,\" \"karakter,\" \"gacha,\" \"grafis,\" and \"hp.\"\n- Similar to the left section, the size of the words corresponds to their frequency or importance in the context of negative sentiment towards performance.\n\n**Common Observations**\n- Both word clouds contain a mix of Indonesian and English words, suggesting that the data or context involves a multilingual user base or discussion.\n- The presence of words like \"game,\" \"story,\" \"fitur,\" and \"grafis\" indicates that the performance being discussed is related to a video game or a similar interactive application.\n- The visualization effectively highlights the contrasting sentiments through the use of different colors for positive and negative sentiments.\n\n**Overall**\nThe image provides a clear visual representation of the sentiments associated with the performance of a game or application, highlighting both positive and negative aspects through the use of word clouds."
  ],
  "0__page_12_Picture_11.jpeg": [
    "This is Image #6 / Fig.6 / Figure 6: \n**Gambar 6.** *Wordcloud feature* <markdown>\nImage Analysis: ##Image Analysis:\n\nThe image presents a visualization consisting of two word clouds, side by side, with distinct color schemes and labels. \n\nThe left word cloud is labeled \"Word Cloud for Positive Sentiment - Feature\" and is predominantly green. The right word cloud is labeled \"Word Cloud for Negative Sentiment - Feature\" and is predominantly red.\n\n**Left Word Cloud (Positive Sentiment):**\n- The most prominent words are \"main\", \"bagus\", and \"game\".\n- Other visible words include \"grafik\", \"seru\", \"suka\", \"karakter\", and \"update\".\n- The font sizes vary, indicating different frequencies or importance of the words.\n\n**Right Word Cloud (Negative Sentiment):**\n- The most prominent words are \"game\", \"main\", and \"tolong\".\n- Other visible words include \"update\", \"bug\", \"error\", \"karakter\", and \"story\".\n- Similar to the left word cloud, the font sizes vary, indicating different frequencies or importance of the words.\n\n**Common Observations:**\n- Both word clouds contain a mix of Indonesian and English words.\n- The word \"game\" and \"main\" appear in both clouds, suggesting they are significant in both positive and negative sentiments.\n- The overall structure of both word clouds is similar, with a central large word surrounded by smaller words.\n\n**Visible Information:**\n- The image does not provide explicit frequency counts or scales for the word sizes.\n- The sentiment analysis is categorized into positive and negative sentiments, related to \"Feature\".\n\nThis description focuses on the visible elements and avoids speculation about the data or context beyond what is presented in the image."
  ],
  "0__page_13_Figure_5.jpeg": [
    "This is Image #7 / Fig.7 / Figure 7: \n![](0__page_13_Figure_6.jpeg) <markdown>\nImage Analysis: ##Image Analysis:\n\nThe image presents a heatmap titled \"Average Evaluation Metrics for Each Aspect.\" The heatmap is a 4x4 matrix, with four evaluation metrics on the x-axis and four aspects on the y-axis. The x-axis labels are \"accuracy,\" \"precision,\" \"recall,\" and \"f1_score,\" while the y-axis labels are \"Gameplay,\" \"Visual,\" \"Performance,\" and \"Feature.\"\n\nEach cell in the heatmap contains a numerical value representing the average evaluation metric for the corresponding aspect and metric. The values are color-coded, with a gradient ranging from blue (lower values) to red (higher values). The color bar on the right side of the heatmap indicates the scale, with values ranging from approximately 0.910 to 0.945.\n\nThe numerical values in the heatmap are as follows:\n\n- Gameplay: accuracy = 0.9110, precision = 0.9206, recall = 0.9110, f1_score = 0.9125\n- Visual: accuracy = 0.9230, precision = 0.9240, recall = 0.9230, f1_score = 0.9228\n- Performance: accuracy = 0.9380, precision = 0.9439, recall = 0.9380, f1_score = 0.9396\n- Feature: accuracy = 0.9270, precision = 0.9312, recall = 0.9270, f1_score = 0.9284\n\nThe heatmap is structured to facilitate comparison of the average evaluation metrics across different aspects and metrics. The color coding allows for a quick visual assessment of the relative performance of each aspect across the various metrics. The image does not contain any additional annotations or statistical information beyond the heatmap and its associated labels and color bar."
  ]
}